

# 番型对应赔付倍数
KIND_VALUE_MAP = {  '九宝莲灯':88, '十三幺':88, '连七对':88, '大四喜':88, '大三元':88, '十八罗汉':88, '绿一色':88, \
                    '豪华七小对':64, '清幺九':64, '四暗刻':64, '小四喜':64, '小三元':64, '字一色':64, '一色双龙会':64, \
                    '一色四同顺':48, '一色四节高':48, \
                    '混幺九':32, '三杠':32, '一色四步高':32, \
                    '清一色':24, '七小对':24, '七星不靠':24, '全小':24, '全中':24, '全大':24, '全双刻':24, '一色三同顺':24, '一色三节高':24, \
                    '清龙':16, '三暗刻':16, '三同刻':16, '三色双龙会':16, '一色三步高':16, '全带五':16, \
                    '全不靠':12, '组合龙':12, '大于五':12, '小于五':12, '三风刻':12, \
                    '花龙':8, '推不倒':8, '三色三同顺':8, '无番和':8, '海底捞月':8, '杠上开花':8, '抢杠和':8, '三色三节高':8, \
                    '碰碰胡':6, '混一色':6, '双暗杠':6, '双箭刻':6, '五门齐':6, '全求人':6, '三色三步高':6, \
                    '全带幺':4, '不求人':4, '双明杠':4, '和绝张':4, \
                    '箭刻':2, '圈风刻':2, '门风刻':2, '门前清':2, '平和':2, '四归一':2, '双同刻':2, '双暗刻':2, '暗杠':2, '断幺':2, \
                    '鸡胡':1, \
                    '杠爆':0}
# 天胡/地胡赔付倍数
TIANHU, DIHU = 13, 12
# 海底捞月赔付倍数
HAIDILAOYUE = {'0': 0, '1': 1}
# 明杠/暗杠赔付倍数
MINGGANG, ANGANG = 1, 2

# 玩家初始筹码
PLAYER_INIT_MONEY = 100